app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2009-12-03 20:14:59', 'a22630ddefe46af67389db84753c6716e8968c7354c6df8e53a404e8373ec2946aab290edd90c0f266d64acd9f4ff90548673762ee2aaf8120cff4cdf2b6bd1a', '2009-12-03 20:14:59', 'marchdoe', '12nVDVGS6y-LLtIB4HSQ', '8b5d6c852a340fceed690068ecb1299ff35fde23b2f8bd3dc3e9ef6deac6ab36616db7bbdcc29cb742f590beabf18a15d0d325655921d7004bca7f6e93f28f18', 'dougmarch@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save